VstrmIntg/CacheManagement/CMEV2/gSoapFiles/LAMServiceForCMESoapBinding.getExportURL.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.i-zq.com/services/LAMServiceForCME"
 xmlns:ns2="http://cme.integration.am.izq.com">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns2:getExportURL>
   <providerID></providerID>
   <providerAssetID></providerAssetID>
   <clusterID></clusterID>
  </ns2:getExportURL>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
